ch1/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-07-13 Wed 14:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Kevin Ling" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline6">1. Chatper 1</a>
<ul>
<li><a href="#orgheadline1">1.1. Exercise 1.1:</a></li>
<li><a href="#orgheadline2">1.2. Exercise 1.2:</a></li>
<li><a href="#orgheadline3">1.3. Exercise 1.3:</a></li>
<li><a href="#orgheadline4">1.4. Exercise 1.4:</a></li>
<li><a href="#orgheadline5">1.5. Exercise 1.5:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">1</span> Chatper 1</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Exercise 1.1:</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-scheme">10
(+ 5 3 4)
(- 9 1)
(/ 6 2)
(+ (* 2 4) (- 4 6))
(<span style="color: #0000FF;">define</span> <span style="color: #006699;">a</span> 3)
(<span style="color: #0000FF;">define</span> <span style="color: #006699;">b</span> (+ a 1))
(+ a b (* a b))
(= a b)
(<span style="color: #0000FF;">if</span> (<span style="color: #0000FF;">and</span> (&gt; b a) (&lt; b (* a b)))
        b
        a)
(<span style="color: #0000FF;">cond</span> ((= a 4) 6)
          ((= b 4) (+ 6 7 a))
          (<span style="color: #0000FF;">else</span> 25))
(+ 2 (<span style="color: #0000FF;">if</span> (&gt; b a) b a))
(* (<span style="color: #0000FF;">cond</span> ((&gt; a b) a)
                 ((&lt; a b) b)
                 (<span style="color: #0000FF;">else</span> -1))
   (+ a 1))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Exercise 1.2:</h3>
<div class="outline-text-3" id="text-1-2">
<p>
I've rewritten it in valid scheme-format.
</p>
<div class="org-src-container">

<pre class="src src-scheme">(/ (+ 5 4 (- 2 (- 3 (+ 6 (/ 4 5)))))
   (* 3 (- 6 2) (- 2 7)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> Exercise 1.3:</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #0000FF;">define</span> (<span style="color: #006699;">square</span> x) (* x x))

<span style="color: #8D8D84;">; </span><span style="color: #8D8D84; font-style: italic;">A simple implementation</span>
(<span style="color: #0000FF;">define</span> (<span style="color: #006699;">sum-sqr-big-0</span> a b c)
        (<span style="color: #0000FF;">cond</span> ((&gt; a b)
                          (<span style="color: #0000FF;">cond</span> ((&gt; b c) (+ (square a) (square b)))
                                        (<span style="color: #0000FF;">else</span>    (+ (square a) (square c)))))
                  (<span style="color: #0000FF;">else</span>
                          (<span style="color: #0000FF;">cond</span> ((&gt; c a) (+ (square b) (square c)))
                                    (<span style="color: #0000FF;">else</span>    (+ (square b) (square a)))))))

<span style="color: #8D8D84;">; </span><span style="color: #8D8D84; font-style: italic;">a nicer way</span>
(<span style="color: #0000FF;">define</span> (<span style="color: #006699;">sum-of-square</span> x y)
        (+ (square x) (square y)))

(<span style="color: #0000FF;">define</span> (<span style="color: #006699;">bigger</span> x y)
        (<span style="color: #0000FF;">if</span> (&gt; x y)
                x
                y))

(<span style="color: #0000FF;">define</span> (<span style="color: #006699;">smaller</span> x y)
        (<span style="color: #0000FF;">if</span> (&lt; x y)
                x
                y))

(<span style="color: #0000FF;">define</span> (<span style="color: #006699;">sum-sqr-big-1</span> a b c)
        (sum-of-square (bigger a b)
                                   (bigger (smaller a b) c)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> Exercise 1.4:</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<code>((if (&gt; b 0) + -) a b)</code>
</p>
<ul class="org-ul">
<li>if b &gt; 0, then + is the operator and thus a + b is performed.</li>
<li>otherwise, a - b is performed.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.5</span> Exercise 1.5:</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>For applicative-order evaluation, it'll enter a infinite loop. Because firstly interpreter will try to substitute (p) by (p) according to the definiton, but this will never end.</li>
<li>For normal-order evaluation, the result is 0.</li>
</ul>
<p>
<code>(test 0 (p))</code> will be interpret as <code>(if (= 0 0) 0 (p))</code> and then 0, because the predicate expression is evaluated first, (p) will never be substitute.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kevin Ling</p>
<p class="date">Created: 2016-07-13 Wed 14:33</p>
<p class="validation"></p>
</div>
</body>
</html>
